packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000024a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>24</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T20:44:34.209646+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>ngRgzJF4OeXbzwcqHvyRF5cP8WNg09Tgj0FeViseG3LajhjCJxp9XyHWEkeHEibo
cwz94sV/ld0omj9XLn4wYpGgCYuNQVa5bJAZQx3w6ny0dC+9bRYP11r2JGap5KzC
hIwN/+N+GqOF8NmjKZXYppQYr3lYHUICHe5ETQ4c2fvkjwNXTIQXeA3gmCvm/V5Q
XGCjk6Gkki8prtBpeZftgxFZv/FoF5AB2cLpsXnFkbBmhbPXlo5xpDtaWhcrWbUb
Jf6NzSR+0wXuEvaslFpJgIfYMd4fijG/oJ1315ESPL0NVCONGEZRO7Wc1stOzqGx
CTtrfaI8kTHvxjyxItNmJA==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>eRQLsY/GUNx0MaxlDtWE/uS5KSr1wv5M0qb/WI5AsdrngxPwlehiFqt0bEJYNCpb
UFyeVM+9K+cfEJfKD2AT9dn5IA8miToLNSTaDFCK74mUCYWFjjHbDeY7CP/2neJ7
m7qORSonDqErcBYdwc4hOdLv6zYDtkqCqKUVXTLwrk4Q/j9zPX5SKb/FB1ken5On
gz9GmK0BBa55U/tpj6uEXpRVPtmV10gBjBrYsQVkNi9VHTXLeyk+NuEt5rRcy5zP
nT14o4fYoxxSYyIBrpon48dc+g0UctjfJERZGWF2y0J46UGh7zyXA9Le5ZoZFizF
/6x7U9awZ9EKR5SrZ+Nghv/KLg5Pbmw+Wj1SBBhfMkwSAko1P0No9Dj+G65LcUQB
8ItICzr7RfbmxeOfBG7w6dGGmvjPiq+W9p5Im5FJOKRPSoIKYVr6QVbCuweeUIWZ
YI+p2HhnQHk+VSrr0QmkA3tJMxj7D0pZCwpOvoXfuWIaSAz5lD8euOYd/RPCKdm3
3NeIdLN3PdVLdPoynQJm1J0w6sIeSUTVpXIVLOEZDMSgOUskMEMPnPmNTTU1kFaT
AxPiCzLUpf0ozAS7xwv2EJm4hWjzIkCUn0mFLkZVA/WeSUHAQquuqDePAsv7pcO2
e9GIbuFn2FTSiMaMTvgGUw8iHpsqVfyPb89JYAZmThSe7hiidylL9O3ThizAWPjr
YpHLsAWzgTrs97zVrGUuGaXtLQgMK5vAyHSdcskL18AFNlHNxHaEIJFw5M13Qej4
BYame8+YU+W31XMxf0xWCipOLRK7/T14JmbHx4wGLmA6wL9Op88YfskQXu7sA4jR
FGG+mSQvSVuc2MhMv2gWcuQbsICpyaxS9E+RsqS+aXs/RbQxxM5uq8HIwNlKxv+1
e7rlQEnWD0v48bXFvUtnZtXSrqfQiAkrnYkqX33d/wdXPap6vbZQY5GdhexRhwJr
AUojpIJhBzVlJ8aWhwI6qkcYzOHjR9VJcfXZWGI9w8eF5/Y1h/BIWeNyRPrUiYNm
q+KKa3MZWDx3CqNVzJVGuei0ybE9/fYgJvGMR6X0q8V83LTl5hQ5Fs7/6R2Zyf5i
CuCXxKhY9LwPtws6WtgRMoRarDhp7TOIsKTOOzIgjffe7sjdm/dT5vQfQgqKaPdR
O+R2B5Gznj8fffP7xbjCT2WRQEpp5NSU1bjkwz+2fXhhXfqwh8f1RkExdJAmUgZt
S3M+eEpCT+ijcF4GOt8xB1Cv9Fdn0JaWZlRTlkbYdwu8Kkd1zzoDLzNRdeS1Mzex
TwmwYJCTPM/p6fUXkou4LWs8WvjiXW7YyVavdlMBSDlkdFygYmihXuw6OnyQNmZI
ijWksZEjDQ1iLj3IHQ/q0YipQzTHNpEHGAqAndN+mE3EQtsb8A9dYpLOJtJ/0EqI
XAD4ELy3uaLITaI6BNM6GOPdlSPADd1qdAy8bRQwIajkBK9WqVvhsGWj+n43KUri
7ta2+sVwYtRicRKjEEb8FYm4ZsBwh5zRJD/gytmuMqjFy+t9B2pP7SonSof8aKqB
ZJ+xm5JONEci7O0RkHwAUi8PcV8qUnzMLcilqTM4Cbiu1XnhcBTgEtlMJ4F3pq3K
qzwEjhlJwvQJnv7j6uxJMSK2qlSnvBFreq3H9VkWACMchSQ+8x/B2GXtkPl6+DDS
aFVsPD7rFL/9x3qMbJiqFLWeak0u7bXlgfGr69Jm5p+PrN5mXW9OQ6dUuA7aWbu4
nDHvDhwNTW5V562U9Ybp+k2CZr84uzjkw3XMy5Rh7hX+OrQZpCiVUCgnJxBnj2xT
6eF8FkGZt1Nr5x6+IFi6NkUKRNWe/t5kHJYBi/U1TvnLFiGJzBBv/l+OXuUregX2
yXmPLTZwRyzjJMP/rZyBicoA8XR4HVK0MacyQuwEV4BxIAaxAOJn7SiXWlL1Wpwr
LH5yCA+8ADWCdUPOecB+0hNwoMJRtUfFpX3YRejr/rMBwo4Il3znfAh0oGbYhcDg
xAWb6Cn3kupDnwCZ/wGXp4Oiv0q+yKmTou2VHHPP292Kg0y0uxrJAUAmJyDqeuaU
JO901DnYvMok/IllSJUhAXq+R0dcop+WBT6jEYeMrRDcR1p4UTDCWAZO4OeFrlmr
6Vo4gqqe6XEgdNN5jfRT7HFxOZvmIYOK1+pMZucF6Ju0Cz6RPyCQWqnpMcLV7czl
FdNpuRQsBVxbf8zHQbadWh448NC++l63b1eId79wkoHl21Oxn+J7ImS0dMIy6Hfs
2PU5IJJGORHpDiF5b9Cqm+UA613fKZmz22roeCBz3SJfYfHjw43Ot0JgfLBTrLHo
s7o7KC773Ya7fLcEYbHX/sQWdEmorTjhggn8AeKezjuFk3LZ087Lysg7rOaTAjG0
z1asn+VbknNYQOMT+CiO1MUP1fzh6YMg6kelTLTw3b1lif4or/sC2Z8cb+VaB2+B
x5P+f6jaoAE2KSTUeuvydofhdA+jwwe4Aqefl5mZ5vt3X2lYNUfzfOLfvyNrpp2W
XaE0RFk7G2AC/jeYUCZ8EqOPTUfGmrmKfQ4AX0hYzjW/0EicTpMarEBDI5Nk/OxA
fkNU/Y+nG32S1Uy9sCm7GGwrHLg9uTY3NG4f1OidReh+jUMfGDxyo8e9Rnbf288B
kJzzpVEOXcXRhehH2V7vtvajCQNXpD/0ZYZY0FRfnDdXUsAwp06yMuBsRPb7+PgZ
anBm96x4X3WbKcRu0UV8Fmw0tuLVhSlbbyau1IlhKBUuGZKqYqEv9uQqltzXAgMg
6UHtGHmn28+TnHAikrQI9Z854RjYsvr5ASUbss2RG8qnVfLhCHDHsOmj+vCMg5eI
D0xdd0lyZmZvI9P9Bv6LdZPxA/3KV0uG9hwxukUizrTOsBldG5rPamWTRFlBDf1i
OlCY8Zg5WVx7ViqF9OlH20bxjIIErad7BZWO7K55rqIh/13ng/LyKZat+OXkBM98
J1GOzmwFDKrFerMoYXS9KuJSxiQC0xIlynUNaHIMxdagWj5Ua0bLjd9qDdUWk4EX
x+awoRNqTDHwrj0W+y0ETrn+zm48JOgCVfoo4/gMT5wYfQSXXx5PCEydsSFmF00Y
QDDCyUw1qw0stUxV+dHmaer8Vg7BnYvCtUXghoqpQvw1oRWJewDS/Y+vMYgJpcY0
4wrt0uEmeWQZEQsEJqs/3iDNI8NMRVeDvJ7EqAA3kp4z9oNdNniLD7ipPH0h7URx
x06aIGSB0MVsu5bFsZH7r7ei4CRFzwxY6FEcYRUmCp/IGPhQD8hmhnLore2DOlAB
Ru367Gs0hRcVWjuC/v3Qol/H0oVxYRquYVW/r4zZo6C6aep8eyy5A1rQCDUgo1OB
p04nHbGbqhZdeREjuSp7UaiZJKHpz7+57m5pO13DbHLZO34JNfrPy++txwU5M8ob
FIMc1NWmASIZnMeRdv/WDx71Ysr1Nea0nbYchiTyV4GA7ABbeXP93G2h/BhIppBs
VevQkefwF03gY1OCVex6HIWup5kZeudGxKiioyEPZRsGc2t7WW1gkTHjpZuKyk64
Ebpi0Jlg4DISDrPRFmwMI5BM6qrOiVWgIyoQ5MW++gJxRAvV2W0Q2Q==</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>